<!doctype html>
<html lang="ru">
    <head>
        <meta charset="UTF-8">
     
    </head>
    <body>
        
        <?php
        echo "<table border='12'>";
// Переменные с цветами
        $break = "<br />";
        $red = "red";
        $black = "black";
        $green = "green";
        $size = "10em";
        $domain = "#";

        for ($i = 1; $i <= 100; $i++) {

            // Перенос строки после 10
            if ($i % 10 == 1) {
                echo "$break";
            }

            // Деление на 5 - красным
            if (($i % 5 == 0) && ($i !== 85) && ($i !== 90) && ($i !== 65) && ($i !== 75) && ($i !== 80)) {
                echo "<font color='$red'>$i</font>";
            }

            // Деление на 7 - зеленым
            if (($i % 7 == 0) && ($i !== 35) && ($i !== 70) && ($i !== 84) && ($i !== 91) && ($i !== 77)) {
                echo "<font color='$green'>$i</font>";
            }

            // Больше числа от 41 до 50 (преоритет цветам)
            if (($i == 41) || (($i > 42) && ($i <= 44)) || (($i >= 46) && ($i <= 48))) {
                echo "<font size='$size: 10em'>$i</font>";
            }

            // Ссылки от 81 до 90 (преоритет ссылкам)
            if (($i >= 81) && ($i <= 90)) {
                echo "<a href='$domain'>$i</a>";
            }

            // Спрятать числа, которые деляться на 13
            if (($i % 13 == 0) && ($i !== 78)) {
                echo " ";
            }

            // Показать только нечетные от 71 до 80
            if ((($i >= 71) && ($i <= 80)) && ($i % 2 !== 0)) {
                echo $i;
            }





            // Остальные цифры + те, которые не делятся на 13
            if ((($i <= 40) || ($i > 50)) && (($i < 80) || ($i > 90)) && ($i % 5 !== 0) && ($i % 7 !== 0) && ($i % 13 !== 0) && (($i < 80) || ($i > 90)) && (($i < 70) || ($i > 80))) {
                echo "<font color='$black'>$i</font>";
            }
        }
        ?>
        
    </body>
</html>
